Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.Illuminance
The illuminance intensity value.
The illuminance value in lx as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The illuminance value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.Distance
The illuminance intensity distance value.
The illuminance distance value in feet as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The distance value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.#ctor(Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity)
Creates a copy of the given initial illuminance intensity object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.#ctor(System.Double,System.Double)
Creates an initial illuminance intensity object with the given document and illuminance values.
distance:
The illuminance distance value in feet as a numerical value between 0 and 1e+30.
illuminance:
The illuminance value in lx as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The distance value is not valid because it is not between 0 and 1e+30.
-or-
The illuminance value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity
This class encapsulates initial illuminance intensity calculation.
Since:
2013